app/controllers/mini_quests_controller.rb

  def index
    @mini_quests = MiniQuest.all
---
SELECT "mini_quests".* FROM "mini_quests"

  def create
    @mini_quest = MiniQuest.new(mini_quest_params)

    respond_to do |format|
      if @mini_quest.save
---
INSERT INTO "mini_quests" ("completed_text", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed_text", "ejrfljw"], ["created_at", "2014-10-29 19:36:15.915819"], ["description", "jrfljqwrjf"], ["title", "lwejfj"], ["updated_at", "2014-10-29 19:36:15.915819"]]

  def update
    respond_to do |format|
      if @mini_quest.update(mini_quest_params)
---
UPDATE "mini_quests" SET "completed_text" = ?, "updated_at" = ? WHERE "mini_quests"."id" = 2  [["completed_text", "## Congratz you made it."], ["updated_at", "2014-11-01 13:12:41.327690"]]

    def set_mini_quest
      @mini_quest = MiniQuest.find(params[:id])
---
SELECT  "mini_quests".* FROM "mini_quests"  WHERE "mini_quests"."id" = ? LIMIT 1  [["id", 1]]