app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT "quests".* FROM "quests"

  def create
    @quest = Quest.new(quest_params)

    respond_to do |format|
      if @quest.save
---
INSERT INTO "quests" ("completed_text", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed_text", "refk;lwkf;lw"], ["created_at", "2014-11-01 20:09:13.682890"], ["description", "jfwjlfkw"], ["title", "Not empty list"], ["updated_at", "2014-11-01 20:09:13.682890"]]

  def update
    respond_to do |format|
      if @quest.update(quest_params)
---
UPDATE "quests" SET "completed_text" = ?, "updated_at" = ? WHERE "quests"."id" = 1  [["completed_text", "refk;lwkf;lwd"], ["updated_at", "2014-11-01 20:09:44.093381"]]

    def set_quest
      @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests"  WHERE "quests"."id" = ? LIMIT 1  [["id", 1]]