app/controllers/quiz_questions_controller.rb

SELECT "quiz_questions".* FROM "quiz_questions"
---
  def index
    @quiz_questions = QuizQuestion.all