app/controllers/random_questions_controller.rb

  def index
    @random_questions = RandomQuestion.all
---
SELECT "random_questions".* FROM "random_questions"

  def create
    @random_question = RandomQuestion.new(random_question_params)

    respond_to do |format|
      if @random_question.save
---
INSERT INTO "random_questions" ("answer_1", "answer_2", "answer_3", "answer_4", "correct_answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_random_question
      @random_question = RandomQuestion.find(params[:id])
---
SELECT  "random_questions".* FROM "random_questions"  WHERE "random_questions"."id" = ? LIMIT 1  [["id", 1]]